import json

with open('case_2_input_data.json') as json_file:
    data = json.load(json_file)

for item in data['ГруппаНоменклатура']:
    print(f"Группа Номенклатура\n"
          f"Ссылка - {item['Ссылка']}\n"
          f"Родитель - {item['Родитель']}\n"
          f"Наименование - {item['Наименование']}\n"
          f"Пометка Удаления - {item['ПометкаУдаления']}")
    print('-----------------------------------------------')

for item in data['ЕдиницыИзмерения']:
    print(f"Единицы Измерения\n"
          f"Наименование - {item['Наименование']}\n"
          f"Ссылка - {item['Ссылка']}\n"
          f"Наименование Полное - {item['НаименованиеПолное']}\n"
          f"Коэффициент - {item['Коэффициент']}")
    print('-----------------------------------------------')

for item in data['Номенклатура']:
    print(f"Номенклатура\n"
          f"Ссылка - {item['Ссылка']}\n"
          f"Родитель - {item['Родитель']}\n"
          f"Пометка Удаления - {item['ПометкаУдаления']}\n"
          f"Артикул - {item['Артикул']}\n"
          f"Наименование - {item['Наименование']}\n"
          f"Ставка НДС - {item['СтавкаНДС']}\n"
          f"Описание - {item['Описание']}\n"
          f"Единица Хранения Остатков - {item['ЕдиницаХраненияОстатков']}\n"
          f"Вести Учет По Характеристикам - {item['ВестиУчетПоХарактеристикам']}\n"
          f"ТипНоменклатуры - {item['ТипНоменклатуры']}\n"
          f"Штрихкод - {item['Штрихкод']}\n"
          f"Файл - {item['Файл']}\n"
          f"Путь - {item['Путь']}\n"
          f"Основное - {item['Основное']}\n"
          )
    print('-----------------------------------------------')
